In [27]:
import pandas as pd
from sqlalchemy import create_engine

In [28]:
Vancouver_csv_file = "../Resources/crime_csv_all_years.csv"
Vancouver_csv_df = pd.read_csv(Vancouver_csv_file)
Vancouver_csv_df.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y
0,Theft from Vehicle,2003,4,29,14.0,0.0,23XX W 7TH AVE,Kitsilano,488378.25,5457008.26
1,Break and Enter Commercial,2003,11,1,5.0,0.0,23XX E HASTINGS ST,Grandview-Woodland,495820.60,5458719.06
2,Theft of Vehicle,2003,5,18,17.0,0.0,10XX E BROADWAY AVE,Mount Pleasant,493944.67,5456629.46
3,Break and Enter Residential/Other,2003,4,1,10.0,0.0,54XX WALES ST,Renfrew-Collingwood,496232.24,5453579.56
4,Theft of Vehicle,2003,12,11,9.0,0.0,26XX BLANCA ST,West Point Grey,484344.26,5456805.39

In [29]:
new_Vancouver_csv_df = Vancouver_csv_df[['TYPE', 'YEAR', 'MONTH', 'X', 'Y']].copy()
new_Vancouver_csv_df.head()

                                TYPE  YEAR  MONTH          X           Y
0                 Theft from Vehicle  2003      4  488378.25  5457008.26
1         Break and Enter Commercial  2003     11  495820.60  5458719.06
2                   Theft of Vehicle  2003      5  493944.67  5456629.46
3  Break and Enter Residential/Other  2003      4  496232.24  5453579.56
4                   Theft of Vehicle  2003     12  484344.26  5456805.39

In [37]:
rds_connection_string = "postgres:Rav6islexus!!!@localhost:5432/Crime"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [38]:
engine.table_names()

['city', 'registercrime', 'crimestype', 'census']

In [34]:
new_Vancouver_csv_df.to_sql(name='Vancouver_csv_file', con=engine, if_exists='append', index=False)

In [ ]:
pd.read_sql_query('select * from Vancouver_CRIME_CSV', con=engine).head()